# Data Wrangling

In [231]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
import os

from library.sb_utils import save_file

In [232]:
# Load data
train = pd.read_csv('/Users/ramijauregui/Desktop/Data_Analysis_Projects/Springboard/Capstone_Two/raw_data/train.csv')
test = pd.read_csv('/Users/ramijauregui/Desktop/Data_Analysis_Projects/Springboard/Capstone_Two/raw_data/test.csv',\
                  index_col='Id')
spray = pd.read_csv('/Users/ramijauregui/Desktop/Data_Analysis_Projects/Springboard/Capstone_Two/raw_data/spray.csv')
weather = pd.read_csv('/Users/ramijauregui/Desktop/Data_Analysis_Projects/Springboard/Capstone_Two/raw_data/weather.csv')

## Train and Test Data

### Explore all columns

In [233]:
# inspect train dataframe 
train.head()

,Date,Address,Species,Block,Street,Trap,AddressNumberAndStreet,Latitude,Longitude,AddressAccuracy,NumMosquitos,WnvPresent
0,2007-05-29,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX PIPIENS/RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.954690,-87.800991,9,1,0
1,2007-05-29,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.954690,-87.800991,9,1,0
2,2007-05-29,"6200 North Mandell Avenue, Chicago, IL 60646, USA",CULEX RESTUANS,62,N MANDELL AVE,T007,"6200 N MANDELL AVE, Chicago, IL",41.994991,-87.769279,9,1,0
3,2007-05-29,"7900 West Foster Avenue, Chicago, IL 60656, USA",CULEX PIPIENS/RESTUANS,79,W FOSTER AVE,T015,"7900 W FOSTER AVE, Chicago, IL",41.974089,-87.824812,8,1,0
4,2007-05-29,"7900 West Foster Avenue, Chicago, IL 60656, USA",CULEX RESTUANS,79,W FOSTER AVE,T015,"7900 W FOSTER AVE, Chicago, IL",41.974089,-87.824812,8,4,0

In [234]:
# shape of train dataframe
train.shape

(10506, 12)

In [235]:
# dtypes of train dataframe
train.dtypes

Date                       object
Address                    object
Species                    object
Block                       int64
Street                     object
Trap                       object
AddressNumberAndStreet     object
Latitude                  float64
Longitude                 float64
AddressAccuracy             int64
NumMosquitos                int64
WnvPresent                  int64
dtype: object

In [236]:
# missing values of train dataframe
train.isna().sum()

Date                      0
Address                   0
Species                   0
Block                     0
Street                    0
Trap                      0
AddressNumberAndStreet    0
Latitude                  0
Longitude                 0
AddressAccuracy           0
NumMosquitos              0
WnvPresent                0
dtype: int64

In [237]:
# unique values of Date column
train['Date'].unique()

array(['2007-05-29', '2007-06-05', '2007-06-26', '2007-06-29',
       '2007-07-02', '2007-07-11', '2007-07-18', '2007-07-19',
       '2007-07-25', '2007-07-27', '2007-08-01', '2007-08-02',
       '2007-08-03', '2007-08-07', '2007-08-08', '2007-08-09',
       '2007-08-15', '2007-08-16', '2007-08-17', '2007-08-21',
       '2007-08-22', '2007-08-24', '2007-08-28', '2007-09-04',
       '2007-09-05', '2007-09-06', '2007-09-12', '2007-09-18',
       '2007-09-19', '2007-09-24', '2007-09-25', '2007-10-04',
       '2007-10-09', '2009-05-28', '2009-06-02', '2009-06-03',
       '2009-06-05', '2009-06-12', '2009-06-15', '2009-06-19',
       '2009-06-22', '2009-06-26', '2009-06-29', '2009-07-06',
       '2009-07-10', '2009-07-13', '2009-07-17', '2009-07-24',
       '2009-07-27', '2009-07-31', '2009-08-07', '2009-08-13',
       '2009-08-25', '2009-08-27', '2009-09-03', '2009-09-14',
       '2009-09-17', '2009-09-25', '2009-10-01', '2011-06-10',
       '2011-06-17', '2011-06-24', '2011-06-30', '2011-07-11',
       '2011-07-15', '2011-07-25', '2011-07-29', '2011-08-05',
       '2011-08-12', '2011-08-19', '2011-08-26', '2011-09-01',
       '2011-09-02', '2011-09-12', '2011-09-16', '2011-09-23',
       '2011-09-30', '2013-06-07', '2013-06-14', '2013-06-21',
       '2013-06-27', '2013-06-28', '2013-07-08', '2013-07-12',
       '2013-07-19', '2013-07-25', '2013-08-01', '2013-08-08',
       '2013-08-15', '2013-08-22', '2013-08-29', '2013-09-06',
       '2013-09-12', '2013-09-19', '2013-09-26'], dtype=object)

From looking at the unique dates we can say that there is no clear regular pattern as to when each sample was taken.

In [238]:
# unique values in Species column
train['Species'].unique()

array(['CULEX PIPIENS/RESTUANS', 'CULEX RESTUANS', 'CULEX PIPIENS',
       'CULEX SALINARIUS', 'CULEX TERRITANS', 'CULEX TARSALIS',
       'CULEX ERRATICUS'], dtype=object)

In [239]:
# unique values in Block column
train['Block'].unique()

array([41, 62, 79, 15, 25, 11, 21, 22, 17, 53, 65, 75, 89, 91, 36, 72, 38,
       49, 58, 50, 14, 10, 42, 40, 43, 28, 18, 70, 35, 93, 37, 45, 46, 60,
       61, 27, 68, 30, 96, 64, 12, 20, 33, 52, 67, 73, 39, 47, 55, 71, 77,
       63, 13, 81, 24, 80, 82, 98, 66, 48, 51, 90, 29, 34])

In [240]:
# unique values in Trap column
train['Trap'].unique()

array(['T002', 'T007', 'T015', 'T045', 'T046', 'T048', 'T049', 'T050',
       'T054', 'T086', 'T091', 'T094', 'T096', 'T129', 'T143', 'T148',
       'T153', 'T159', 'T009', 'T011', 'T016', 'T019', 'T025', 'T028',
       'T031', 'T033', 'T089', 'T090', 'T092', 'T135', 'T141', 'T142',
       'T145', 'T146', 'T147', 'T149', 'T150', 'T151', 'T152', 'T154',
       'T158', 'T162', 'T218', 'T220', 'T001', 'T003', 'T006', 'T008',
       'T012', 'T034', 'T037', 'T040', 'T043', 'T047', 'T051', 'T085',
       'T088', 'T161', 'T219', 'T013', 'T014', 'T018', 'T030', 'T084',
       'T144', 'T160', 'T005', 'T017', 'T044', 'T095', 'T004', 'T035',
       'T036', 'T039', 'T060', 'T061', 'T062', 'T065', 'T066', 'T067',
       'T069', 'T070', 'T071', 'T073', 'T074', 'T075', 'T076', 'T077',
       'T079', 'T080', 'T081', 'T082', 'T083', 'T114', 'T155', 'T063',
       'T115', 'T138', 'T200', 'T206', 'T209', 'T212', 'T215', 'T107',
       'T128', 'T072', 'T078', 'T097', 'T099', 'T100', 'T102', 'T103',
       'T027', 'T156', 'T157', 'T221', 'T900', 'T903', 'T222', 'T223',
       'T225', 'T227', 'T224', 'T226', 'T229', 'T230', 'T228', 'T232',
       'T231', 'T235', 'T233', 'T236', 'T237', 'T238', 'T094B', 'T054C'],
      dtype=object)

In [241]:
# unique addresses
train['Address'].unique()

array(['4100 North Oak Park Avenue, Chicago, IL 60634, USA',
       '6200 North Mandell Avenue, Chicago, IL 60646, USA',
       '7900 West Foster Avenue, Chicago, IL 60656, USA',
       '1500 West Webster Avenue, Chicago, IL 60614, USA',
       '2500 West Grand Avenue, Chicago, IL 60654, USA',
       '1100 Roosevelt Road, Chicago, IL 60608, USA',
       '1100 West Chicago Avenue, Chicago, IL 60642, USA',
       '2100 North Stave Street, Chicago, IL 60647, USA',
       '2200 North Cannon Drive, Chicago, IL 60614, USA',
       '2200 West 113th Street, Chicago, IL 60643, USA',
       '1100 South Peoria Street, Chicago, IL 60608, USA',
       '1700 West 95th Street, Chicago, IL 60643, USA',
       '2200 West 89th Street, Chicago, IL 60643, USA',
       'North Streeter Drive, Chicago, IL 60611, USA',
       '6500 North Oak Park Avenue, Chicago, IL 60631, USA',
       '7500 North Oakley Avenue, Chicago, IL 60645, USA',
       '1500 North Long Avenue, Chicago, IL 60651, USA',
       '8900 South Carpenter Street, Chicago, IL 60620, USA',
       '9100 West Higgins Avenue, Chicago, IL 60656, USA',
       '3600 North Pittsburgh Avenue, Chicago, IL 60634, USA',
       '7200 North Oketo Avenue, Chicago, IL 60631, USA',
       '3800 North California Avenue, Chicago, IL 60618, USA',
       '4900 West Balmoral Avenue, Chicago, IL 60630, USA',
       '5800 North Western Avenue, Chicago, IL 60659, USA',
       '5000 South Central Avenue, Chicago, IL 60638, USA',
       '1400 North Sacramento Avenue, Chicago, IL 60622, USA',
       'South Vincennes Avenue, Chicago, IL, USA',
       'University of Illinois at Chicago, 1100 South Ashland Avenue, Chicago, IL 60607, USA',
       '1100 South State Street, Chicago, IL 60605, USA',
       '4200 West 127th Street, Alsip, IL 60803, USA',
       '5300 West Agatite Avenue, Chicago, IL 60630, USA',
       '4000 North Austin Avenue, Chicago, IL 60634, USA',
       'Chicago, IL, USA',
       '4200 North Richmond Street, Chicago, IL 60618, USA',
       '2800 North Francisco Avenue, Chicago, IL 60618, USA',
       '1500 West Granville Avenue, Chicago, IL 60660, USA',
       '1800 West Farwell Avenue, Chicago, IL 60626, USA',
       '7000 West Armitage Avenue, Chicago, IL 60707, USA',
       '2500 South Millard Avenue, Chicago, IL 60623, USA',
       '2100 North Lawler Avenue, Chicago, IL 60639, USA',
       '3500 West 116th Street, Chicago, IL 60655, USA',
       '9300 South Doctor Martin Luther King Junior Drive, Chicago, IL 60619, USA',
       '3700 North Kedvale Avenue, Chicago, IL 60641, USA',
       '4500 North Campbell Avenue, Chicago, IL 60625, USA',
       '4000 North Tripp Avenue, Chicago, IL 60641, USA',
       '4600 Milwaukee Avenue, Chicago, IL 60630, USA',
       '6000 North Avondale Avenue, Chicago, IL 60631, USA',
       '7000 North Moselle Avenue, Chicago, IL 60646, USA',
       '6100 North Lemont Avenue, Chicago, IL 60646, USA',
       '2700 South Western Avenue, Chicago, IL 60608, USA',
       '6800 West Belden Avenue, Chicago, IL 60707, USA',
       '2100 South Hamlin Avenue, Chicago, IL 60623, USA',
       '3000 West 18th Street, Chicago, IL 60608, USA',
       '1100 South California Avenue, Chicago, IL 60612, USA',
       '2500 South Throop Street, Chicago, IL 60608, USA',
       '1000 West 95th Street, Chicago, IL 60643, USA',
       '1000 South California Avenue, Chicago, IL 60612, USA',
       '9600 South Hoyne Avenue, Chicago, IL 60643, USA',
       '1800 West Leland Avenue, Chicago, IL 60640, USA',
       '6100 West Fullerton Avenue, Chicago, IL 60639, USA',
       '6400 West Strong Street, Chicago, IL, USA',
       '1200 West Greenleaf Avenue, Chicago, IL 60626, USA',
       '1000 North Central Park Avenue, Chicago, IL 60651, USA',
       '2000 East 111th Street, Chicago, IL 60628, USA',
       '3300 North Rutherford Avenue, Chicago, IL 60634, USA',
       '1100 North Artesian Avenue, Chicago, IL 60622, USA',
       '6000 West Roscoe Street, Chicago, IL 60634, USA',
       '6000 West Montrose Avenue, Chicago, IL 60634, USA',
       '3300 West Randolph Street, Chicago, IL 60612, USA',
       '3300 West 104th Street, Chicago, IL 60655, USA',
       '4900 West Sunnyside Avenue, Chicago, IL 60630, USA',
       '3000 South Hoyne Avenue, Chicago, IL 60608, USA',
       '4200 West 31st Street, Chicago, IL 60623, USA',
       '1700 North Pulaski Road, Chicago, IL 60639, USA',
       '2200 West Pershing Road, Chicago, IL 60609, USA',
       '2200 West 51st Street, Chicago, IL 60609, USA',
       '3500 West 51st Street, Chicago, IL 60632, USA',
       'Chicago Midway International Airport (MDW), 5200 West 63rd Street, Chicago, IL 60638, USA',
       '6700 South Kedzie Avenue, Chicago, IL 60629, USA',
       '7300 Cicero Avenue, Chicago, IL 60638, USA',
       '2200 West 69th Street, Chicago, IL 60636, USA',
       '5200 South Nordica Avenue, Chicago, IL 60638, USA',
       '6100 South Melvina Avenue, Chicago, IL 60638, USA',
       '1000 East 67th Street, Chicago, IL 60637, USA',
       '3900 South Ashland Avenue, Chicago, IL 60609, USA',
       '4700 South Cornell Avenue, Chicago, IL 60615, USA',
       '5500 South Doctor Martin Luther King Junior Drive, Chicago, IL 60637, USA',
       '6400 South Stony Island Avenue, Chicago, IL 60637, USA',
       '7100 South South Shore Drive, Chicago, IL 60649, USA',
       '7700 South Eberhart Avenue, Chicago, IL 60619, USA',
       '4000 South Dearborn Street, Chicago, IL 60609, USA',
       '5000 South Union Avenue, Chicago, IL 60609, USA',
       '7900 South South Chicago Avenue, Chicago, IL 60617, USA',
       '5200 South Kolmar Avenue, Chicago, IL 60632, USA',
       '6300 West 64th Street, Chicago, IL 60638, USA',
       '3700 South Pulaski Road, Chicago, IL 60623, USA',
       'South Doty Avenue, Chicago, IL, USA',
       'South Stony Island Avenue, Chicago, IL, USA',
       'South Torrence Avenue, Chicago, IL, USA',
       'South Mackinaw Avenue, Chicago, IL 60617, USA',
       'South Brandon Avenue, Chicago, IL 60617, USA',
       '3700 118th Street, Chicago, IL 60617, USA',
       '3800 East 115th Street, Chicago, IL 60617, USA',
       'East 91st Street, Chicago, IL, USA',
       '2400 East 105th Street, Chicago, IL 60617, USA',
       '8000 South Kedzie Avenue, Chicago, IL 60652, USA',
       '6500 South Racine Avenue, Chicago, IL 60636, USA',
       'East 138th Street, Riverdale, IL 60827, USA',
       '8900 South Muskegon Avenue, Chicago, IL 60617, USA',
       '9800 South Avenue G, Chicago, IL 60617, USA',
       'South Cottage Grove Avenue, Chicago, IL, USA',
       'South Avenue L, Chicago, IL 60617, USA',
       '5800 North Pulaski Road, Chicago, IL 60646, USA',
       '6600 South Kilpatrick Avenue, Chicago, IL 60629, USA',
       'West 37th Place, Chicago, IL, USA',
       '4000 East 130th Street, Chicago, IL 60633, USA',
       '9100 West Higgins Road, Rosemont, IL 60018, USA',
       "ORD Terminal 5, O'Hare International Airport, Chicago, IL 60666, USA",
       'Ohare Court, Bensenville, IL 60106, USA',
       '4800 West Montana Street, Chicago, IL 60639, USA',
       '5100 North Mont Clare Avenue, Chicago, IL 60656, USA',
       '8200 South Kostner Avenue, Chicago, IL 60652, USA',
       'East 91st Place, Chicago, IL, USA',
       '1700 West Addison Street, Chicago, IL 60613, USA',
       'West Garfield Boulevard, Chicago, IL, USA',
       'South Wallace Street, Chicago, IL, USA',
       '1300 North Laramie Avenue, Chicago, IL 60651, USA',
       '3900 North Springfield Avenue, Chicago, IL 60618, USA',
       '1700 North Ashland Avenue, Chicago, IL 60622, USA',
       '5100 West 72nd Street, Chicago, IL 60638, USA',
       '5800 North Ridge Avenue, Chicago, IL 60660, USA',
       '4200 West 65th Street, Chicago, IL 60621, USA',
       '7100 North Harlem Avenue, Chicago, IL 60631, USA',
       '6200 North Mcclellan Avenue, Chicago, IL 60646, USA',
       '2900 West 85th Street, Chicago, IL 60652, USA',
       '3400 West 77th Street, Chicago, IL 60652, USA',
       '9600 South Longwood Drive, Chicago, IL 60643, USA',
       '2100 North Cannon Drive, Chicago, IL 60614, USA'], dtype=object)

In [242]:
# value counts of AddressAccuracy column
train['AddressAccuracy'].value_counts()

8    4628
9    3980
5    1807
3      91
Name: AddressAccuracy, dtype: int64

In [243]:
# value counts for NumMosquitos column
train['NumMosquitos'].value_counts()

1     2307
2     1300
50    1019
3      896
4      593
5      489
6      398
7      326
8      244
9      237
10     206
11     170
13     163
12     132
16     128
14     120
15     112
17     107
18      92
19      86
21      85
20      79
23      69
27      67
37      61
24      57
26      57
22      56
25      50
39      49
29      48
36      47
31      47
30      44
28      43
35      43
46      43
43      39
32      39
47      37
33      36
48      36
45      35
38      35
49      35
41      31
34      31
42      29
40      28
44      25
Name: NumMosquitos, dtype: int64

We know from the given info about the data that the data is organized in a way that when the number of mosquitos exceeds 50, the results are split into another row. We will want to condense all of these rows into a single data entry.

In order to condense the data, we need to make sure that there are no discrepancies between the columns that indicate location. These columns would be `Address`, `Street`, `AddressNumberAndStreet`, `Trap`, `Latitude`, and `Longitude`.

In [244]:
print('Total Values for Given Columns')
print('Address: {}'.format(train['Address'].nunique()))
print('Street: {}'.format(train['Street'].nunique()))
print('AddressNumberAndStreet: {}'.format(train['AddressNumberAndStreet'].nunique()))
print('Trap: {}'.format(train['Trap'].nunique()))
print('Latitude: {}'.format(train['Latitude'].nunique()))
print('Longitude: {}'.format(train['Longitude'].nunique()))

Total Values for Given Columns
Address: 138
Street: 128
AddressNumberAndStreet: 138
Trap: 136
Latitude: 138
Longitude: 138

This indicates that there are traps that have multiple addresses. We need to find them and fix them. This also indicates that there are possibly multiple unique addresses in the same streets. We should also check to make sure that this is the case.

In [245]:
# function to check discrepancy between two columns
def check_discrepancy(df, column1, column2):
    """This function checks if there are multiple unique values in column2 for each unique 
    value in column1 of the dataframe df.
    """
    
    lst = list(df[column1].unique())
    counter = 0
    for i in lst:
        if len(list(df[df[column1] == i][column2].unique())) >= 2:
            print('{}: {}      {}: {}'\
                  .format(column1, i,\
                          column2, list(df[df[column1] == i][column2].unique())))
        else:
            counter += 1
    if counter == len(lst):
        print('There are no discrepancies between {} and {}'\
             .format(column1, column2))

In [246]:
# check street/address discrepancy
check_discrepancy(train, 'Street', 'Address')

Street:  N OAK PARK AVE      Address: ['4100 North Oak Park Avenue, Chicago, IL 60634, USA', '6500 North Oak Park Avenue, Chicago, IL 60631, USA']
Street:  N CANNON DR      Address: ['2200 North Cannon Drive, Chicago, IL 60614, USA', '2100 North Cannon Drive, Chicago, IL 60614, USA']
Street:  W 95TH ST      Address: ['1700 West 95th Street, Chicago, IL 60643, USA', '1000 West 95th Street, Chicago, IL 60643, USA']
Street:  S ASHLAND AVE      Address: ['University of Illinois at Chicago, 1100 South Ashland Avenue, Chicago, IL 60607, USA', '3900 South Ashland Avenue, Chicago, IL 60609, USA']
Street:  S DR MARTIN LUTHER KING JR DR      Address: ['9300 South Doctor Martin Luther King Junior Drive, Chicago, IL 60619, USA', '5500 South Doctor Martin Luther King Junior Drive, Chicago, IL 60637, USA']
Street:  S HOYNE AVE      Address: ['9600 South Hoyne Avenue, Chicago, IL 60643, USA', '3000 South Hoyne Avenue, Chicago, IL 60608, USA']
Street:  N PULASKI RD      Address: ['1700 North Pulaski Road, Chicago, IL 60639, USA', '5800 North Pulaski Road, Chicago, IL 60646, USA']
Street:  W 51ST ST      Address: ['2200 West 51st Street, Chicago, IL 60609, USA', '3500 West 51st Street, Chicago, IL 60632, USA']
Street:  S KEDZIE AVE      Address: ['6700 South Kedzie Avenue, Chicago, IL 60629, USA', '8000 South Kedzie Avenue, Chicago, IL 60652, USA']
Street:  S STONY ISLAND AVE      Address: ['6400 South Stony Island Avenue, Chicago, IL 60637, USA', 'South Stony Island Avenue, Chicago, IL, USA']

There is no issue between the `Street` and `Address` columns. Now we should check fir discrepancy between `Trap` and `Address`.

In [247]:
# check trap/address discrepancy
check_discrepancy(train, 'Trap', 'Address')

Trap: T009      Address: ['9100 West Higgins Avenue, Chicago, IL 60656, USA', '9100 West Higgins Road, Rosemont, IL 60018, USA']
Trap: T035      Address: ['3000 South Hoyne Avenue, Chicago, IL 60608, USA', '5100 West 72nd Street, Chicago, IL 60638, USA']

Traps T009 and T035 have two different addresses attached to them. We should check if the same dicrepancy is found between `Trap` and `Latitude` and `Longitude`.

In [248]:
# check trap/latitude discrepancy
check_discrepancy(train, 'Trap', 'Latitude')

Trap: T009      Latitude: [41.981964, 41.992478]
Trap: T035      Latitude: [41.836644, 41.763733]

In [249]:
# check trap/longitude discrepancy
check_discrepancy(train, 'Trap', 'Longitude')

Trap: T009      Longitude: [-87.812827, -87.862995]
Trap: T035      Longitude: [-87.677737, -87.742302]

We can now see that traps `T009` and `T035` have discrepancies in the `Address`, `Latitude`, and `Longitude` columns. We want to check if the multiple addresses match the latitude and latitude coordinates assigned to these traps.

#### Find corresponding values of T009 and T035

In [250]:
# Address value counts of T035 trap
train[train['Trap'] == 'T009']['Address'].value_counts()

9100 West Higgins Road, Rosemont, IL 60018, USA     80
9100 West Higgins Avenue, Chicago, IL 60656, USA    31
Name: Address, dtype: int64

In [251]:
# latitude value counts of T009 trap
train[train['Trap'] == 'T009']['Latitude'].value_counts()

41.992478    80
41.981964    31
Name: Latitude, dtype: int64

In [252]:
# longitude value counts of T009 trap
train[train['Trap'] == 'T009']['Longitude'].value_counts()

-87.862995    80
-87.812827    31
Name: Longitude, dtype: int64

In [253]:
# T009 address coordinates [Address, Latitude, Longitude]
print(['9100 West Higgins Avenue, Chicago, IL 60656, USA', 41.981964, -87.812827])
print(['9100 West Higgins Road, Rosemont, IL 60018, USA',41.992478,-87.862995])

['9100 West Higgins Avenue, Chicago, IL 60656, USA', 41.981964, -87.812827]
['9100 West Higgins Road, Rosemont, IL 60018, USA', 41.992478, -87.862995]

From checking google maps and looking at the value counts for each value, we found that these were the corresponding coordinates for these addreses. Now let's do the same for the T035 trap.

In [254]:
# Address value counts of T035 trap
train[train['Trap'] == 'T035']['Address'].value_counts()

5100 West 72nd Street, Chicago, IL 60638, USA      45
3000 South Hoyne Avenue, Chicago, IL 60608, USA    27
Name: Address, dtype: int64

In [255]:
# latitude value counts of T035 trap
train[train['Trap'] == 'T035']['Latitude'].value_counts()

41.763733    45
41.836644    27
Name: Latitude, dtype: int64

In [256]:
# longitude value counts of T035 trap
train[train['Trap'] == 'T035']['Longitude'].value_counts()

-87.742302    45
-87.677737    27
Name: Longitude, dtype: int64

In [257]:
# T035 address coordinates [Address, Latitude, Longitude]
print(['5100 West 72nd Street, Chicago, IL 60638, USA', 41.763733, -87.742302])
print(['3000 South Hoyne Avenue, Chicago, IL 60608, USA', 41.836644, -87.677737])

['5100 West 72nd Street, Chicago, IL 60638, USA', 41.763733, -87.742302]
['3000 South Hoyne Avenue, Chicago, IL 60608, USA', 41.836644, -87.677737]

To fix these discrepancies, we will rename the entries with the least values for each of thsese two traps as `T009A` and `T035A` respectively.

In [258]:
# rename traps with '9100 West Higgins Avenue, Chicago, IL 60656, USA' address as 'T009A'
train.loc[train['Address'] == '9100 West Higgins Avenue, Chicago, IL 60656, USA', 'Trap']\
= 'T009A'

# verify the name change worked appropriately
train[(train['Address'] == '9100 West Higgins Avenue, Chicago, IL 60656, USA')\
    & (train['Latitude'] == 41.981964)\
    & (train['Longitude'] == -87.812827)]['Trap'].value_counts()

T009A    31
Name: Trap, dtype: int64

In [259]:
# rename traps with '3000 South Hoyne Avenue, Chicago, IL 60608, USA' address as 'T035A'
train.loc[train['Address'] == '3000 South Hoyne Avenue, Chicago, IL 60608, USA', 'Trap']\
= 'T035A'

# verify the name change worked appropriately
train[(train['Address'] == '3000 South Hoyne Avenue, Chicago, IL 60608, USA')\
    & (train['Latitude'] == 41.836644)\
    & (train['Longitude'] == -87.677737)]['Trap'].value_counts()

T035A    27
Name: Trap, dtype: int64

Now lets verify that there is no more discrepancy between `Trap` and `Address`, `Latitude`, `Longitude`.

In [260]:
print('Total Values for Given Columns')
print('Address: {}'.format(train['Address'].nunique()))
print('Street: {}'.format(train['Street'].nunique()))
print('AddressNumberAndStreet: {}'.format(train['AddressNumberAndStreet'].nunique()))
print('Trap: {}'.format(train['Trap'].nunique()))
print('Latitude: {}'.format(train['Latitude'].nunique()))
print('Longitude: {}'.format(train['Longitude'].nunique()))

Total Values for Given Columns
Address: 138
Street: 128
AddressNumberAndStreet: 138
Trap: 138
Latitude: 138
Longitude: 138

In [261]:
# check trap/address discrepancy
check_discrepancy(train, 'Trap', 'Address')

There are no discrepancies between Trap and Address

In [262]:
# check trap/latitude discrepancy
check_discrepancy(train, 'Trap', 'Latitude')

There are no discrepancies between Trap and Latitude

In [263]:
# check trap/longitude discrepancy
check_discrepancy(train, 'Trap', 'Longitude')

There are no discrepancies between Trap and Longitude

In [264]:
# check trap/AddressAccuracy discrepancy
check_discrepancy(train, 'Trap', 'AddressAccuracy')

There are no discrepancies between Trap and AddressAccuracy

In [265]:
train.dtypes

Date                       object
Address                    object
Species                    object
Block                       int64
Street                     object
Trap                       object
AddressNumberAndStreet     object
Latitude                  float64
Longitude                 float64
AddressAccuracy             int64
NumMosquitos                int64
WnvPresent                  int64
dtype: object

In [266]:
# function to check discrepancy between two columns and return a dictionary
def check_discrepancy_2(df, column1, column2):
    """This function checks if there are multiple unique values in column2 for each unique 
    value in column1 of the dataframe df and returns a dictionary with the results
    """
    
    lst = list(df[column1].unique())
    dic = {}
    counter = 0
    for i in lst:
        if len(list(df[df[column1] == i][column2].unique())) >= 2:
            dic[i] = list(df[df[column1] == i][column2].unique())    
#            print('{}: {}      {}: {}'\
#                  .format(column1, i,\
#                          column2, list(df[df[column1] == i][column2].unique())))
        else:
            counter += 1
    return dic                      
    if counter == len(lst):
        print('There are no discrepancies between {} and {}'\
             .format(column1, column2))

In [267]:
check_discrepancy_2(train, 'Trap', 'Address')

{}

### Condense `NumMosquitos` into single entry

Now that we have properly addressed any discrepancies, we can go forward with condensing the data as previously mentioned.

Since we now have a unique address for each trap, these columns is now redundant and we can remove the `Address`, `Street`, and `AddressNumberAndStreet` columns. 

We also want to create a dataframe that includes all the traps and their respective address, latitude and longitude for possible future reference.

In [268]:
# dataframe of traps with their respective address and coordinates
trap_list = list(train['Trap'].unique())
trap_loc = {}
for trap in trap_list:
    trap_loc[trap] = [list(train[train['Trap'] == trap]['Address'].unique())[0],\
                            list(train[train['Trap'] == trap]['Latitude'].unique())[0],\
                            list(train[train['Trap'] == trap]['Longitude'].unique())[0]]
    
trap_locations = pd.DataFrame.from_dict(trap_loc, orient='index').reset_index()
trap_locations.rename(columns={'index': 'Trap', 0:'Address', 1:'Latitude', 2:'Longitude'},
             inplace=True)
trap_locations

,Trap,Address,Latitude,Longitude
0,T002,"4100 North Oak Park Avenue, Chicago, IL 60634,...",41.954690,-87.800991
1,T007,"6200 North Mandell Avenue, Chicago, IL 60646, USA",41.994991,-87.769279
2,T015,"7900 West Foster Avenue, Chicago, IL 60656, USA",41.974089,-87.824812
3,T045,"1500 West Webster Avenue, Chicago, IL 60614, USA",41.921600,-87.666455
4,T046,"2500 West Grand Avenue, Chicago, IL 60654, USA",41.891118,-87.654491
...,...,...,...,...
133,T236,"6200 North Mcclellan Avenue, Chicago, IL 60646...",41.994679,-87.770899
134,T237,"2900 West 85th Street, Chicago, IL 60652, USA",41.738903,-87.695443
135,T238,"3400 West 77th Street, Chicago, IL 60652, USA",41.753391,-87.707394
136,T094B,"9600 South Longwood Drive, Chicago, IL 60643, USA",41.719140,-87.669539
137,T054C,"2100 North Cannon Drive, Chicago, IL 60614, USA",41.925652,-87.633590

In [269]:
# drop all address columns
train1 = train.drop(labels=['Address', 'Street', 'AddressNumberAndStreet'], axis=1)
train1.head()

,Date,Species,Block,Trap,Latitude,Longitude,AddressAccuracy,NumMosquitos,WnvPresent
0,2007-05-29,CULEX PIPIENS/RESTUANS,41,T002,41.954690,-87.800991,9,1,0
1,2007-05-29,CULEX RESTUANS,41,T002,41.954690,-87.800991,9,1,0
2,2007-05-29,CULEX RESTUANS,62,T007,41.994991,-87.769279,9,1,0
3,2007-05-29,CULEX PIPIENS/RESTUANS,79,T015,41.974089,-87.824812,8,1,0
4,2007-05-29,CULEX RESTUANS,79,T015,41.974089,-87.824812,8,4,0

In [270]:
# sum all the NumMosquitos for each unique entry
grpby_order = ['Trap', 'Block', 'Latitude', 'Longitude', 'Date', 'Species', 'WnvPresent', 'AddressAccuracy']
summed = train1.groupby(grpby_order).sum()
summed.reset_index(inplace=True)
column_order = ['Date', 'Trap', 'Block', 'Latitude', 'Longitude', 'Species', 'AddressAccuracy', 'NumMosquitos', 
                'WnvPresent']
traps = summed
traps

,Trap,Block,Latitude,Longitude,Date,Species,WnvPresent,AddressAccuracy,NumMosquitos
0,T001,40,41.953705,-87.733974,2007-06-26,CULEX PIPIENS/RESTUANS,0,8,1
1,T001,40,41.953705,-87.733974,2007-07-11,CULEX PIPIENS/RESTUANS,0,8,1
2,T001,40,41.953705,-87.733974,2007-07-18,CULEX PIPIENS,0,8,1
3,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS,0,8,1
4,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS/RESTUANS,0,8,3
...,...,...,...,...,...,...,...,...,...
8605,T903,10,41.957799,-87.930995,2013-08-08,CULEX PIPIENS,0,5,3
8606,T903,10,41.957799,-87.930995,2013-08-22,CULEX PIPIENS/RESTUANS,0,5,2
8607,T903,10,41.957799,-87.930995,2013-08-29,CULEX PIPIENS,0,5,11
8608,T903,10,41.957799,-87.930995,2013-09-06,CULEX PIPIENS,0,5,20
8609,T903,10,41.957799,-87.930995,2013-09-12,CULEX PIPIENS/RESTUANS,0,5,10

### Test Data

We will not be using the given test data as we will be creating our own train and test data from the created `traps` dataframe.

## Spray Data

In [271]:
spray.head()

         Date        Time   Latitude  Longitude
0  2011-08-29  6:56:58 PM  42.391623 -88.089163
1  2011-08-29  6:57:08 PM  42.391348 -88.089163
2  2011-08-29  6:57:18 PM  42.391022 -88.089157
3  2011-08-29  6:57:28 PM  42.390637 -88.089158
4  2011-08-29  6:57:38 PM  42.390410 -88.088858

In [272]:
spray.Date.value_counts()

2013-08-15    2668
2013-08-29    2302
2013-07-17    2202
2011-09-07    2114
2013-07-25    1607
2013-08-22    1587
2013-08-08    1195
2013-09-05     924
2013-08-16     141
2011-08-29      95
Name: Date, dtype: int64

## Weather Data

In [273]:
# inspect weather dataframe
weather.head(10)

,Station,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,...,CodeSum,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,1,2007-05-01,83,50,67,14,51,56,0,2,...,,0,M,0.0,0.00,29.10,29.82,1.7,27,9.2
1,2,2007-05-01,84,52,68,M,51,57,0,3,...,,M,M,M,0.00,29.18,29.82,2.7,25,9.6
2,1,2007-05-02,59,42,51,-3,42,47,14,0,...,BR,0,M,0.0,0.00,29.38,30.09,13.0,4,13.4
3,2,2007-05-02,60,43,52,M,42,47,13,0,...,BR HZ,M,M,M,0.00,29.44,30.08,13.3,2,13.4
4,1,2007-05-03,66,46,56,2,40,48,9,0,...,,0,M,0.0,0.00,29.39,30.12,11.7,7,11.9
5,2,2007-05-03,67,48,58,M,40,50,7,0,...,HZ,M,M,M,0.00,29.46,30.12,12.9,6,13.2
6,1,2007-05-04,66,49,58,4,41,50,7,0,...,RA,0,M,0.0,T,29.31,30.05,10.4,8,10.8
7,2,2007-05-04,78,51,M,M,42,50,M,M,...,,M,M,M,0.00,29.36,30.04,10.1,7,10.4
8,1,2007-05-05,66,53,60,5,38,49,5,0,...,,0,M,0.0,T,29.40,30.10,11.7,7,12.0
9,2,2007-05-05,66,54,60,M,39,50,5,0,...,,M,M,M,T,29.46,30.09,11.2,7,11.5

In [274]:
# shape of weather
weather.shape

(2944, 22)

In [275]:
# dtypes of weather
weather.dtypes

Station          int64
Date            object
Tmax             int64
Tmin             int64
Tavg            object
Depart          object
DewPoint         int64
WetBulb         object
Heat            object
Cool            object
Sunrise         object
Sunset          object
CodeSum         object
Depth           object
Water1          object
SnowFall        object
PrecipTotal     object
StnPressure     object
SeaLevel        object
ResultSpeed    float64
ResultDir        int64
AvgSpeed        object
dtype: object

   By looking at the provided pdf file about this data, we can see that any value marked as 'M' means there is missing data. Another thing to note is that there are a handful of columns that are object types that should be floats. We will also be converting integers to floats for continuity.

In [276]:
# list of columns
cols = list(weather.columns)

In [277]:
print('Unique Dates at Station 1: {}'.format(weather[weather['Station'] == 1].Date.nunique()))
print('Unique Dates at Station 2: {}'.format(weather[weather['Station'] == 2].Date.nunique()))

Unique Dates at Station 1: 1472
Unique Dates at Station 2: 1472

##### Replacing `M` with `NaN`

In [278]:
# replacing 'M' with 'NaN'
weather = weather.replace('M', np.nan)
weather.head()

,Station,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,...,CodeSum,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,1,2007-05-01,83,50,67,14,51,56,0,2,...,,0,NaN,0.0,0.00,29.10,29.82,1.7,27,9.2
1,2,2007-05-01,84,52,68,NaN,51,57,0,3,...,,NaN,NaN,NaN,0.00,29.18,29.82,2.7,25,9.6
2,1,2007-05-02,59,42,51,-3,42,47,14,0,...,BR,0,NaN,0.0,0.00,29.38,30.09,13.0,4,13.4
3,2,2007-05-02,60,43,52,NaN,42,47,13,0,...,BR HZ,NaN,NaN,NaN,0.00,29.44,30.08,13.3,2,13.4
4,1,2007-05-03,66,46,56,2,40,48,9,0,...,,0,NaN,0.0,0.00,29.39,30.12,11.7,7,11.9

#### Cleaning `Tmax` and `Tmin`  Columns

In [279]:
# unique values of Tmax and Tmin columns
print(weather['Tmax'].unique())
print(weather['Tmin'].unique())

[ 83  84  59  60  66  67  78  68  82  80  77  76  70  73  64  65  69  90
  62  61  71  79  87  89  88  75  85  86  81  72  63  91  92  93  74  94
  54  53  56  57  58  55  50  95  52  47  45  51  48  44  49  46  96  99
 100 101  97  98 102 103 104  42  41]
[50 52 42 43 46 48 49 51 53 54 47 60 61 63 56 59 44 57 45 55 66 65 70 68
 62 67 64 58 71 69 73 75 72 74 39 41 40 37 34 38 35 36 33 31 32 76 77 29
 78 79 80 81 82 83]

In [280]:
# number of missing values of Tmax and Tmin columns
print(weather['Tmax'].isna().sum())
print(weather['Tmin'].isna().sum())

0
0

In [281]:
# converting values to floats
weather['Tmax'] = weather['Tmax'].astype(float)
weather['Tmin'] = weather['Tmin'].astype(float)

#### Cleaning `Tavg`  Column

In [282]:
# unique values of Tavg column
weather['Tavg'].unique()

array(['67', '68', '51', '52', '56', '58', nan, '60', '59', '65', '70',
       '69', '71', '61', '55', '57', '73', '72', '53', '62', '63', '74',
       '75', '78', '76', '77', '66', '80', '64', '81', '82', '79', '85',
       '84', '83', '50', '49', '46', '48', '45', '54', '47', '44', '40',
       '41', '38', '39', '42', '37', '43', '86', '87', '89', '92', '88',
       '91', '93', '94', '90', '36'], dtype=object)

In [283]:
# number of missing values in Tavg Column
weather['Tavg'].isna().sum()

11

In [284]:
# columns with missing Tavg values
weather[weather['Tavg'].isna()]

,Station,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,...,CodeSum,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
7,2,2007-05-04,78.0,51.0,NaN,NaN,42,50,NaN,NaN,...,,NaN,NaN,NaN,0.00,29.36,30.04,10.1,7,10.4
505,2,2008-07-08,86.0,46.0,NaN,NaN,68,71,NaN,NaN,...,TS RA,NaN,NaN,NaN,0.28,29.16,29.80,7.4,24,8.3
675,2,2008-10-01,62.0,46.0,NaN,NaN,41,47,NaN,NaN,...,,NaN,NaN,NaN,0.00,29.30,29.96,10.9,33,11.0
1637,2,2011-07-22,100.0,71.0,NaN,NaN,70,74,NaN,NaN,...,TS TSRA BR,NaN,NaN,NaN,0.14,29.23,29.86,3.8,10,8.2
2067,2,2012-08-22,84.0,72.0,NaN,NaN,51,61,NaN,NaN,...,,NaN,NaN,NaN,0.00,29.39,NaN,4.7,19,NaN
2211,2,2013-05-02,71.0,42.0,NaN,NaN,39,45,NaN,NaN,...,,NaN,NaN,NaN,0.00,29.51,30.17,15.8,2,16.1
2501,2,2013-09-24,91.0,52.0,NaN,NaN,48,54,NaN,NaN,...,,NaN,NaN,NaN,0.00,29.33,30.00,5.8,9,7.7
2511,2,2013-09-29,84.0,53.0,NaN,NaN,48,54,NaN,NaN,...,RA BR,NaN,NaN,NaN,0.22,29.36,30.01,6.3,36,7.8
2525,2,2013-10-06,76.0,48.0,NaN,NaN,44,50,NaN,NaN,...,RA DZ BR,NaN,NaN,NaN,0.06,29.10,29.76,10.1,25,10.6
2579,2,2014-05-02,80.0,47.0,NaN,NaN,43,47,NaN,NaN,...,RA,NaN,NaN,NaN,0.04,29.10,29.79,10.7,23,11.9
2811,2,2014-08-26,86.0,49.0,NaN,NaN,68,71,NaN,NaN,...,,NaN,NaN,NaN,T,29.41,30.04,1.3,15,5.8

Since the rows with missing values in the `Tavg` column have values in the `Tmax` and `Tmin` columns, we will simply recalculate the average temperature from  `Tmax` and `Tmin` into a new column and drop the current `Tavg` column.

In [285]:
# drop current Tavg column
weather = weather.drop('Tavg', axis=1)

In [286]:
# recalculate new Tavg from Tmax and Tmin
weather['Tavg'] = (weather['Tmax'] + weather['Tmin']) /2
weather.head()

,Station,Date,Tmax,Tmin,Depart,DewPoint,WetBulb,Heat,Cool,Sunrise,...,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed,Tavg
0,1,2007-05-01,83.0,50.0,14,51,56,0,2,0448,...,0,NaN,0.0,0.00,29.10,29.82,1.7,27,9.2,66.5
1,2,2007-05-01,84.0,52.0,NaN,51,57,0,3,-,...,NaN,NaN,NaN,0.00,29.18,29.82,2.7,25,9.6,68.0
2,1,2007-05-02,59.0,42.0,-3,42,47,14,0,0447,...,0,NaN,0.0,0.00,29.38,30.09,13.0,4,13.4,50.5
3,2,2007-05-02,60.0,43.0,NaN,42,47,13,0,-,...,NaN,NaN,NaN,0.00,29.44,30.08,13.3,2,13.4,51.5
4,1,2007-05-03,66.0,46.0,2,40,48,9,0,0446,...,0,NaN,0.0,0.00,29.39,30.12,11.7,7,11.9,56.0

We want to rearrange the columns so the new `Tavg` column is next to the `Tmin` column.

In [287]:
# rearrange columns
weather = weather[['Station', 'Date', 'Tmax', 'Tmin', 'Tavg', 'Depart', 'DewPoint', 'WetBulb', 'Heat',\
                      'Cool', 'Sunrise', 'Sunset', 'CodeSum', 'Depth', 'Water1', 'SnowFall', 'PrecipTotal',\
                      'StnPressure', 'SeaLevel', 'ResultSpeed', 'ResultDir', 'AvgSpeed']]
weather.head()

,Station,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,...,CodeSum,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,1,2007-05-01,83.0,50.0,66.5,14,51,56,0,2,...,,0,NaN,0.0,0.00,29.10,29.82,1.7,27,9.2
1,2,2007-05-01,84.0,52.0,68.0,NaN,51,57,0,3,...,,NaN,NaN,NaN,0.00,29.18,29.82,2.7,25,9.6
2,1,2007-05-02,59.0,42.0,50.5,-3,42,47,14,0,...,BR,0,NaN,0.0,0.00,29.38,30.09,13.0,4,13.4
3,2,2007-05-02,60.0,43.0,51.5,NaN,42,47,13,0,...,BR HZ,NaN,NaN,NaN,0.00,29.44,30.08,13.3,2,13.4
4,1,2007-05-03,66.0,46.0,56.0,2,40,48,9,0,...,,0,NaN,0.0,0.00,29.39,30.12,11.7,7,11.9

#### Cleaning `Depart`, `DewPoint`, `WetBulb`, `Heat`, and `Cool` Columns

In [288]:
# unique values of 'Depart' column
weather['Depart'].unique()

array(['14', nan, '-3', ' 2', ' 4', ' 5', '10', '12', '13', '-2', '15',
       '11', '-4', '-6', ' 8', '-5', ' 1', ' 9', ' 6', '-9', '-8', ' 3',
       ' 0', '-1', '-7', ' 7', '-14', '18', '16', '22', '21', '20', '-10',
       '-16', '17', '-12', '-11', '-15', '-17', '19', '-13', '23'],
      dtype=object)

In [289]:
# unique values of 'DewPoint' column
weather['DewPoint'].unique()

array([51, 42, 40, 41, 38, 39, 30, 58, 57, 59, 60, 52, 44, 36, 37, 33, 32,
       47, 45, 56, 43, 31, 50, 46, 49, 48, 54, 53, 55, 61, 63, 62, 64, 65,
       66, 67, 69, 70, 68, 71, 72, 73, 35, 34, 29, 27, 28, 23, 24, 25, 22,
       26, 75, 74])

In [290]:
# unique values of 'WetBulb' column
weather['WetBulb'].unique()

array(['56', '57', '47', '48', '50', '49', '46', '54', '53', '62', '63',
       '60', '61', '51', '59', '58', '43', '44', '45', '65', '66', '67',
       '64', '52', '55', '69', '68', '70', '72', '71', '73', '74', '76',
       '42', '39', '40', '41', '35', '33', '34', nan, '75', '36', '32',
       '38', '78', '77', '37'], dtype=object)

In [291]:
# unique values of 'Heat' column
weather['Heat'].unique()

array(['0', '14', '13', '9', '7', nan, '5', '6', '4', '10', '8', '12',
       '3', '2', '1', '15', '16', '19', '17', '20', '11', '18', '21',
       '25', '24', '27', '26', '23', '28', '22', '29'], dtype=object)

In [292]:
# unique values of 'Cool' column
weather['Cool'].unique()

array([' 2', ' 3', ' 0', nan, ' 5', ' 4', ' 6', ' 8', ' 7', ' 9', '10',
       '13', '11', '12', ' 1', '15', '16', '17', '14', '20', '19', '18',
       '21', '22', '24', '27', '23', '26', '28', '29', '25'], dtype=object)

We can see that all of these columns are object types. We want to change this to float types.

In [293]:
weather['Depart'] = weather['Depart'].astype(float)
weather['DewPoint'] = weather['DewPoint'].astype(float)
weather['WetBulb'] = weather['WetBulb'].astype(float)
weather['Heat'] = weather['Heat'].astype(float)
weather['Cool'] = weather['Cool'].astype(float)

#### Cleaning `Sunrise` and `Sunset` Columns

In [294]:
# unique values of 'Sunrise' column
weather['Sunrise'].unique()

array(['0448', '-', '0447', '0446', '0444', '0443', '0442', '0441',
       '0439', '0438', '0437', '0436', '0435', '0434', '0433', '0432',
       '0431', '0430', '0429', '0428', '0427', '0426', '0425', '0424',
       '0423', '0422', '0421', '0420', '0419', '0418', '0417', '0416',
       '0440', '0445', '0449', '0450', '0451', '0452', '0453', '0454',
       '0455', '0456', '0457', '0458', '0459', '0500', '0501', '0502',
       '0503', '0504', '0505', '0506', '0508', '0509', '0510', '0511',
       '0512', '0513', '0514', '0515', '0516', '0517', '0518', '0519',
       '0520', '0521', '0522', '0523', '0524', '0525', '0526', '0527',
       '0528', '0529', '0530', '0531', '0532', '0533', '0535', '0536',
       '0537', '0538', '0539', '0540', '0541', '0542', '0543', '0544',
       '0545', '0546', '0547', '0548', '0549', '0550', '0552', '0553',
       '0554', '0555', '0556', '0557', '0558', '0559', '0600', '0602',
       '0603', '0604', '0605', '0606', '0607', '0608', '0610', '0611',
       '0612', '0613', '0614', '0616', '0617', '0618', '0619', '0620',
       '0622', '0623'], dtype=object)

In [295]:
# unique values of 'Sunset' column
weather['Sunset'].unique()

array(['1849', '-', '1850', '1851', '1852', '1853', '1855', '1856',
       '1857', '1858', '1859', '1860', '1901', '1902', '1903', '1904',
       '1905', '1906', '1907', '1908', '1909', '1910', '1911', '1912',
       '1913', '1914', '1915', '1916', '1917', '1918', '1919', '1920',
       '1921', '1922', '1923', '1924', '1925', '1926', '1927', '1928',
       '1929', '1930', '1931', '1900', '1854', '1848', '1846', '1845',
       '1843', '1842', '1840', '1839', '1837', '1835', '1834', '1832',
       '1831', '1829', '1827', '1826', '1824', '1822', '1821', '1819',
       '1817', '1815', '1814', '1812', '1810', '1809', '1807', '1805',
       '1803', '1760', '1758', '1756', '1755', '1753', '1751', '1749',
       '1748', '1746', '1744', '1742', '1741', '1739', '1737', '1735',
       '1734', '1732', '1730', '1729', '1727', '1725', '1724', '1722',
       '1720', '1719', '1717', '1715', '1714', '1712', '1711', '1709',
       '1707', '1706', '1704', '1703', '1701', '1660', '1658', '1657',
       '1656', '1654', '1653', '1651', '1650', '1649', '1647'],
      dtype=object)

Both of these columns have `-` for missing values. We want to replace this with proper NaN values and convert to floats.

In [296]:
weather['Sunrise'] = weather['Sunrise'].replace('-', np.nan)
weather['Sunset'] = weather['Sunset'].replace('-', np.nan)

In [297]:
weather['Sunrise'] = weather['Sunrise'].astype(float)
weather['Sunset'] = weather['Sunset'].astype(float)

#### Cleaning `CodeSum` Column

In [298]:
# value counts for 'CodeSum' column
weather['CodeSum'].value_counts()

                    1609
RA                   296
RA BR                238
BR                   110
TSRA RA BR            92
                    ...
RA DZ SN               1
TS TSRA RA FG BR       1
BR HZ VCFG             1
TS RA FG+ FG BR        1
RA SN BR               1
Name: CodeSum, Length: 98, dtype: int64

In [299]:
# unique values of 'CodeSum' column
weather['CodeSum'].unique()

array([' ', 'BR', 'BR HZ', 'HZ', 'RA', 'RA BR', 'TSRA RA BR', 'RA VCTS',
       'TSRA RA', 'RA HZ', 'TSRA RA BR HZ', 'TSRA BR HZ', 'RA BR HZ VCTS',
       'TSRA RA HZ', 'TSRA BR HZ VCTS', 'TSRA', 'TSRA BR HZ FU',
       'TSRA RA HZ FU', 'BR HZ FU', 'TSRA RA VCTS', 'HZ VCTS', 'TSRA HZ',
       'VCTS', 'RA BR VCTS', 'TSRA RA BR VCTS', 'TS TSRA RA BR HZ VCTS',
       'DZ BR', 'TS TSRA RA BR HZ', 'TS TSRA BR HZ', 'RA BR HZ',
       'TSRA RA DZ BR HZ', 'TS TSRA RA BR', 'TS RA BR', 'TS TSRA RA',
       'TS TSRA RA BR VCTS', 'TS TSRA BR', 'TS RA', 'RA BCFG BR',
       'TSRA BR', 'RA DZ FG+ BCFG BR', 'RA FG+ MIFG BR', 'RA DZ',
       'RA DZ BR', 'TS TSRA RA HZ', 'TSRA RA FG+ FG BR',
       'TSRA DZ FG+ FG BR HZ', 'TS BR', 'RA BR SQ', 'TS TSRA',
       'TSRA RA BR HZ VCTS', 'BR VCTS', 'TS', 'FG+ BR HZ', 'RA SN',
       'TSRA RA DZ BR', 'DZ BR HZ', 'RA BR FU', 'TS BR HZ', 'DZ',
       'FG+ BR', 'FG+ FG BR', 'FG+ MIFG BR', 'TSRA RA FG BR',
       'TSRA FG+ BR', 'RA DZ BR HZ', 'RA DZ SN', 'FG+ FG BR HZ',
       'TS TSRA RA FG BR', 'BR HZ VCFG', 'TS RA FG+ FG BR',
       'TSRA RA FG+ BR', 'RA DZ FG+ FG BR', 'TS TSRA RA VCTS', 'FU',
       'TS TSRA VCFG', 'TS TSRA HZ', 'TS TSRA GR RA BR', 'RA FG BR',
       'HZ FU', 'RA BR HZ FU', 'MIFG BCFG BR', 'FG+ BCFG BR',
       'TSRA RA FG+ FG BR HZ', 'FG+', 'TSRA BR SQ', 'TSRA DZ BR HZ',
       'RA BR HZ VCFG', 'RA FG+ BR', 'FG BR HZ', 'TS HZ',
       'TS TSRA RA FG BR HZ', 'RA DZ FG+ BR', 'RA DZ FG+ BR HZ',
       'TSRA FG+ BR HZ', 'RA BR VCFG', 'TS RA BR HZ', 'BCFG BR',
       'RA SN BR'], dtype=object)

We can see that missing values are marked with `' '`. We want to replace that with proper `NaN` values.

In [300]:
# number of missing values in 'CodeSum' column before replacement
weather[weather['CodeSum'] == ' '].shape[0]

1609

In [301]:
# replace ' ' values with proper NaN values in 'CodeSum' column
weather['CodeSum'] = weather['CodeSum'].replace(' ', np.nan)
weather['CodeSum'].isna().sum()

1609

#### Cleaning `Depth` Column

In [302]:
# unique values in the depth column
weather['Depth'].unique()

array(['0', nan], dtype=object)

In [303]:
# number of missing values in depth column
weather['Depth'].isna().sum()

1472

In [304]:
# value counts
weather['Depth'].value_counts()

0    1472
Name: Depth, dtype: int64

We can see that half of the values are missing values and the remaining half are marked as `0`. For now, we will convert the column into floats and we will explore further if there is any use for this column once we begin proper EDA.

In [305]:
# convert depth column to float
weather['Depth'] = weather['Depth'].astype(float)

#### Cleaning `Water1` Column

In [306]:
# unique values in 'Water1' column
weather['Water1'].unique()

array([nan])

It looks like all the values in this column are missing. This column will not do us any good. We will drop this column.

In [307]:
# drop Water1 column
weather = weather.drop('Water1', axis=1)
weather.columns

Index(['Station', 'Date', 'Tmax', 'Tmin', 'Tavg', 'Depart', 'DewPoint',
       'WetBulb', 'Heat', 'Cool', 'Sunrise', 'Sunset', 'CodeSum', 'Depth',
       'SnowFall', 'PrecipTotal', 'StnPressure', 'SeaLevel', 'ResultSpeed',
       'ResultDir', 'AvgSpeed'],
      dtype='object')

#### Cleaning `SnowFall` Column

In [308]:
# unique values in SnowFall column
weather['SnowFall'].unique()

array(['0.0', nan, '  T', '0.1'], dtype=object)

Looking at the provided pdf we can see that a `T` means trace, which denotes an amount greater than 0 but is too small to be measured by standard units or methods of measurement. Since we want to convert this column to float, we will need to replace the T with a number. Given the information provided in the pdf, we will make an estimate and replace the `T` with a value of `0.001`.

In [309]:
# replace T with 0.001
weather['SnowFall'] = weather['SnowFall'].replace('  T', 0.001)

In [310]:
# convert column to float
weather['SnowFall'] = weather['SnowFall'].astype(float)

#### Cleaning `PrecipTotal` Column

In [311]:
# unique values of 'PrecipTotal' column
weather['PrecipTotal'].unique()

array(['0.00', '  T', '0.13', '0.02', '0.38', '0.60', '0.14', '0.07',
       '0.11', '0.09', '1.01', '0.28', '0.04', '0.08', '0.01', '0.53',
       '0.19', '0.21', '0.32', '0.39', '0.31', '0.42', '0.27', '0.16',
       '0.58', '0.93', '0.05', '0.34', '0.15', '0.35', nan, '0.40',
       '0.66', '0.30', '0.24', '0.43', '1.55', '0.92', '0.89', '0.17',
       '0.03', '1.43', '0.97', '0.26', '1.31', '0.06', '0.46', '0.29',
       '0.23', '0.41', '0.45', '0.83', '1.33', '0.91', '0.48', '0.37',
       '0.88', '2.35', '1.96', '0.20', '0.25', '0.18', '0.67', '0.36',
       '0.33', '1.28', '0.74', '0.76', '0.71', '0.95', '1.46', '0.12',
       '0.52', '0.64', '0.22', '1.24', '0.72', '0.73', '0.65', '1.61',
       '1.22', '0.50', '1.05', '2.43', '0.59', '2.90', '2.68', '1.23',
       '0.62', '6.64', '3.07', '1.44', '1.75', '0.82', '0.80', '0.86',
       '0.63', '0.55', '1.03', '0.70', '1.73', '1.38', '0.44', '1.14',
       '1.07', '3.97', '0.87', '0.78', '1.12', '0.68', '0.10', '0.61',
       '0.54', '1.19', '0.75', '0.84', '1.29', '0.81', '1.15', '1.49',
       '1.57', '1.02', '1.30', '0.51', '0.85', '0.79', '0.77', '2.79',
       '3.15', '3.64', '4.73', '1.60', '0.57', '2.24', '1.90', '1.06',
       '1.88', '0.69', '2.17', '6.86', '0.49', '1.11', '1.21', '0.90',
       '1.34', '0.47', '0.56', '3.66', '1.09', '1.25', '1.35', '2.20',
       '1.48', '0.96', '1.16', '1.04', '2.03', '2.09', '1.26', '2.60',
       '2.06', '3.31', '2.76', '1.82', '0.98', '1.58', '3.17', '1.18'],
      dtype=object)

In [312]:
# number of missing value in 'PrecipTotal' column
weather['PrecipTotal'].isna().sum()

2

In [313]:
# value counts for 'PrecipTotal' column
weather['PrecipTotal'].value_counts()

0.00    1577
  T      318
0.01     127
0.02      63
0.03      46
        ...
2.68       1
2.24       1
1.90       1
1.07       1
1.18       1
Name: PrecipTotal, Length: 167, dtype: int64

We will do the same thing we did with the `SnowFall` column and replace the `T` values with 0.001 and convert the column to floats.

In [314]:
# replace T with 0.001
weather['PrecipTotal'] = weather['PrecipTotal'].replace('  T', 0.001)

In [315]:
# convert column to float
weather['PrecipTotal'] = weather['PrecipTotal'].astype(float)

#### Cleaning `StnPressure` Column

In [316]:
# unique values of 'StnPressure' column
weather['StnPressure'].unique()

array(['29.10', '29.18', '29.38', '29.44', '29.39', '29.46', '29.31',
       '29.36', '29.40', '29.57', '29.62', '29.29', '29.21', '29.28',
       '29.20', '29.26', '29.33', '29.49', '29.54', '29.55', '29.23',
       '29.13', '29.19', '29.53', '29.60', '29.34', '29.41', '29.47',
       '29.51', '29.42', '29.43', '29.25', '29.03', '28.82', '28.87',
       '28.88', '29.16', '29.07', '28.84', '28.91', '29.24', nan, '29.30',
       '29.12', '29.45', '29.56', '29.32', '29.05', '29.11', '29.06',
       '29.22', '29.08', '29.14', '29.37', '29.35', '29.15', '29.17',
       '29.48', '29.52', '29.27', '29.50', '28.59', '28.67', '28.75',
       '29.02', '29.79', '29.86', '29.63', '29.70', '28.95', '29.01',
       '28.79', '28.85', '28.97', '28.89', '28.94', '28.93', '28.98',
       '28.96', '29.00', '29.66', '29.09', '28.90', '29.04', '29.59',
       '29.65', '29.58', '29.61', '29.64', '29.71', '29.67', '28.80',
       '28.73', '29.68', '28.74', '28.55', '28.63', '28.92', '28.99',
       '28.81', '28.71', '28.69', '28.77', '28.83'], dtype=object)

In [317]:
# number of missing values in StnPressure column
weather['StnPressure'].isna().sum()

4

In [318]:
# convert column values to float
weather['StnPressure'] = weather['StnPressure'].astype(float)

#### Cleaning `SeaLevel` Column

In [319]:
# unique values in 'SeaLevel' column
weather['SeaLevel'].unique()

array(['29.82', '30.09', '30.08', '30.12', '30.05', '30.04', '30.10',
       '30.29', '30.28', '30.03', '30.02', '29.94', '29.93', '29.92',
       '29.91', '30.20', '30.19', '30.24', '29.97', '29.98', '29.84',
       '29.83', '30.27', '30.25', '30.26', '30.11', '30.06', '30.23',
       '30.15', '30.14', '30.00', '29.99', '29.90', '29.77', '29.76',
       '29.56', '29.54', '29.52', '29.51', '29.79', '29.78', '29.81',
       '29.55', '29.85', '30.07', '30.16', nan, '29.96', '29.95', '30.13',
       '30.21', '30.22', '29.88', '30.01', '29.80', '29.89', '29.74',
       '29.87', '29.86', '30.18', '30.17', '29.34', '29.44', '29.45',
       '29.71', '29.72', '30.52', '30.53', '30.40', '30.41', '29.67',
       '29.53', '29.69', '29.61', '29.64', '29.63', '29.66', '29.70',
       '30.34', '30.33', '29.62', '29.60', '29.75', '29.68', '29.73',
       '30.31', '30.30', '30.32', '30.37', '30.39', '29.59', '29.65',
       '30.35', '30.36', '29.48', '30.38', '29.50', '29.25', '29.23',
       '29.46', '29.43', '29.47'], dtype=object)

In [320]:
# number of missing values in 'SeaLevel' column
weather['SeaLevel'].isna().sum()

9

In [321]:
# convert column values to float
weather['SeaLevel'] = weather['SeaLevel'].astype(float)

#### Cleaning `ResultSpeed` Column

In [322]:
# unique values in 'ResultSpeed' column
weather['ResultSpeed'].unique()

array([ 1.7,  2.7, 13. , 13.3, 11.7, 12.9, 10.4, 10.1, 11.2, 14.4, 13.8,
        8.6,  8.5,  2.5,  3.9,  0.7,  2. , 11.3, 12.4, 12.7,  6.6,  6.4,
       16.9, 14.1,  8.1,  7.8,  8. , 10.5,  5.4,  3.4, 11.1,  6.3, 10. ,
       11.4, 10.9, 14.9,  4.9,  4.5,  2.8,  8.9,  8.2,  4.8,  4.7,  5.8,
       10.3,  9.7,  9.3,  4.2,  6.5,  7.5,  5.2,  7.9,  6.2, 10.8,  9.6,
       22.7, 20.3,  0.3,  2.4,  4.6,  8.3,  9.4,  7.2,  7. ,  5.6,  5.9,
        4.1,  3.8,  2.1,  4. , 14. , 12.2, 10.7,  3.5,  3.7,  7.6,  7.3,
        6.1, 11.9,  7.4,  5.1,  9.5,  6.7,  3.1,  4.3,  3.2,  3.3,  8.4,
       12.6,  8.8,  9.1,  1.4,  1.2,  4.4,  7.7,  1.9,  2.9,  1.1,  3. ,
       10.6,  5.5,  5.7,  1.6,  2.6,  1.5,  6.9,  3.6,  6. ,  0.5,  5.3,
        9. ,  2.2, 12.8,  9.2, 12.1,  1.8,  7.1,  6.8, 12.5,  5. ,  9.8,
        2.3, 11.5, 15.1, 14.6, 17.2, 15.5, 16.2, 17.7, 18. , 16.7, 16. ,
       13.9, 14.5, 10.2, 14.3, 13.7, 19.2, 13.2, 21.1, 11.8, 16.1, 14.8,
        8.7, 11.6, 13.6,  1. , 12. , 17.5, 13.4,  9.9, 11. ,  0.2, 13.5,
       12.3,  1.3,  0.1,  0.6,  0.8, 19.8, 15.6, 15.7, 15. , 14.7, 15.3,
       14.2, 17.4, 16.6, 15.2, 24.1, 21.8, 20.8, 17. , 21.4, 18.8, 13.1,
       15.9,  0.9, 15.4, 17.1, 19.6, 15.8, 16.8, 19.4, 19.3, 17.9,  0.4,
       16.4, 22.6, 21.7])

In [323]:
# number of missing values in 'ResultSpeed' column
weather['ResultSpeed'].isna().sum()

0

#### Cleaning `ResultDir` Column

In [324]:
# unique values in 'ResultDir' column
weather['ResultDir'].unique()

array([27, 25,  4,  2,  7,  6,  8, 11, 10, 18, 17,  9,  3, 36,  1, 14, 21,
       22, 24, 23, 16, 19, 20,  5, 15, 26, 31, 30, 28, 33, 29, 12, 13, 32,
       35, 34])

In [325]:
# number of missing values in ResultDir column
weather['ResultDir'].isna().sum()

0

In [326]:
# converting ResultDir column to float
weather['ResultDir'] = weather['ResultDir'].astype(float)

#### Cleaning `AvgSpeed` Column

In [327]:
# unique values in 'AvgSpeed' column
weather['AvgSpeed'].unique()

array(['9.2', '9.6', '13.4', '11.9', '13.2', '10.8', '10.4', '12.0',
       '11.5', '15.0', '14.5', '10.5', '9.9', '5.8', '5.4', '6.2', '5.9',
       '4.1', '3.9', '12.9', '12.8', '13.0', '8.1', '7.6', '17.3', '14.6',
       '12.3', '12.2', '11.8', '11.3', '7.5', '5.5', '11.4', '10.7',
       '9.7', '8.2', '7.8', '10.2', '10.6', '11.2', '15.2', '8.8', '7.2',
       '9.5', '5.3', '5.2', '6.5', '7.4', '10.1', '6.4', '6.7', '23.1',
       '20.7', '13.8', '12.4', '5.0', '4.7', '5.6', '6.9', '8.4', '10.0',
       '8.6', nan, '6.8', '4.9', '6.1', '6.3', '15.1', '12.6', '7.7',
       '8.7', '9.0', '8.0', '6.0', '7.1', '8.5', '12.5', '13.3', '8.3',
       '7.3', '13.1', '12.7', '10.9', '11.1', '13.9', '6.6', '14.4',
       '9.1', '3.3', '3.5', '4.0', '7.0', '9.4', '7.9', '5.7', '4.3',
       '4.6', '3.7', '11.7', '4.4', '12.1', '13.5', '13.7', '11.0', '9.8',
       '8.9', '10.3', '15.5', '18.9', '17.2', '16.7', '18.0', '18.2',
       '16.8', '14.1', '14.7', '4.2', '9.3', '14.3', '17.7', '17.8',
       '15.9', '19.3', '17.4', '3.8', '4.8', '14.0', '21.5', '19.5',
       '16.3', '5.1', '3.6', '3.2', '4.5', '2.9', '3.1', '2.7', '18.4',
       '16.4', '14.8', '11.6', '13.6', '2.4', '2.6', '3.4', '3.0', '2.1',
       '20.2', '14.9', '16.2', '15.4', '17.9', '14.2', '15.3', '15.7',
       '16.1', '18.8', '17.1', '16.6', '26.3', '21.4', '23.2', '22.1',
       '15.6', '16.9', '2.0', '2.3', '1.7', '19.9', '17.6', '18.5',
       '18.1', '16.0', '15.8', '2.8', '1.9', '22.9', '22.6'], dtype=object)

In [328]:
# number of missing values in 'AvgSpeed' column
weather['AvgSpeed'].isna().sum()

3

In [329]:
# value counts of 'AvgSpeed' column
weather['AvgSpeed'].value_counts()

6.9     63
5.8     60
7.4     55
8.1     49
7.0     47
        ..
15.9     1
19.3     1
18.4     1
21.5     1
22.6     1
Name: AvgSpeed, Length: 177, dtype: int64

In [330]:
# converting 'AvgSpeed' column to float
weather['AvgSpeed'] = weather['AvgSpeed'].astype(float)

In [331]:
weather.dtypes

Station          int64
Date            object
Tmax           float64
Tmin           float64
Tavg           float64
Depart         float64
DewPoint       float64
WetBulb        float64
Heat           float64
Cool           float64
Sunrise        float64
Sunset         float64
CodeSum         object
Depth          float64
SnowFall       float64
PrecipTotal    float64
StnPressure    float64
SeaLevel       float64
ResultSpeed    float64
ResultDir      float64
AvgSpeed       float64
dtype: object

In [332]:
weather.isna().sum()

Station           0
Date              0
Tmax              0
Tmin              0
Tavg              0
Depart         1472
DewPoint          0
WetBulb           4
Heat             11
Cool             11
Sunrise        1472
Sunset         1472
CodeSum        1609
Depth          1472
SnowFall       1472
PrecipTotal       2
StnPressure       4
SeaLevel          9
ResultSpeed       0
ResultDir         0
AvgSpeed          3
dtype: int64

# Merging `weather` and `traps` Dataframes

We want to be able to only use a single dataframe to build out model so we need to merge the `traps` and `weather` dataframes.

Since the weather data has entries from two stations for each date, we will simply take the average of the two stations and use this new values to merge with the `traps` data.

In [333]:
# trake mean of each entry between stations
weather_final = weather.groupby(['Date'], dropna=False).mean().reset_index().drop('Station', axis=1)
weather_final.head()

,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,Sunrise,Sunset,Depth,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,2007-05-01,83.5,51.0,67.25,14.0,51.0,56.5,0.0,2.5,448.0,1849.0,0.0,0.0,0.0000,29.140,29.820,2.20,26.0,9.40
1,2007-05-02,59.5,42.5,51.00,-3.0,42.0,47.0,13.5,0.0,447.0,1850.0,0.0,0.0,0.0000,29.410,30.085,13.15,3.0,13.40
2,2007-05-03,66.5,47.0,56.75,2.0,40.0,49.0,8.0,0.0,446.0,1851.0,0.0,0.0,0.0000,29.425,30.120,12.30,6.5,12.55
3,2007-05-04,72.0,50.0,61.00,4.0,41.5,50.0,7.0,0.0,444.0,1852.0,0.0,0.0,0.0005,29.335,30.045,10.25,7.5,10.60
4,2007-05-05,66.0,53.5,59.75,5.0,38.5,49.5,5.0,0.0,443.0,1853.0,0.0,0.0,0.0010,29.430,30.095,11.45,7.0,11.75

In [334]:
# merge 'traps' and 'weather_final' datasets
data = traps.merge(weather_final, how='left', on='Date')
data.head()

,Trap,Block,Latitude,Longitude,Date,Species,WnvPresent,AddressAccuracy,NumMosquitos,Tmax,...,Sunrise,Sunset,Depth,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,T001,40,41.953705,-87.733974,2007-06-26,CULEX PIPIENS/RESTUANS,0,8,1,91.5,...,418.0,1931.0,0.0,0.0,0.0805,29.420,30.100,6.70,21.5,7.60
1,T001,40,41.953705,-87.733974,2007-07-11,CULEX PIPIENS/RESTUANS,0,8,1,77.0,...,426.0,1928.0,0.0,0.0,0.0000,29.255,29.925,8.95,30.0,11.05
2,T001,40,41.953705,-87.733974,2007-07-18,CULEX PIPIENS,0,8,1,85.0,...,432.0,1924.0,0.0,0.0,1.2350,29.145,29.835,9.70,24.0,10.35
3,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS,0,8,1,91.5,...,445.0,1911.0,0.0,0.0,0.0000,29.315,29.990,2.80,11.0,3.90
4,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS/RESTUANS,0,8,3,91.5,...,445.0,1911.0,0.0,0.0,0.0000,29.315,29.990,2.80,11.0,3.90

In [335]:
# check missing values
data.isna().sum()

Trap               0
Block              0
Latitude           0
Longitude          0
Date               0
Species            0
WnvPresent         0
AddressAccuracy    0
NumMosquitos       0
Tmax               0
Tmin               0
Tavg               0
Depart             0
DewPoint           0
WetBulb            0
Heat               0
Cool               0
Sunrise            0
Sunset             0
Depth              0
SnowFall           0
PrecipTotal        0
StnPressure        0
SeaLevel           0
ResultSpeed        0
ResultDir          0
AvgSpeed           0
dtype: int64

In [336]:
# list of columns in 'data'
list(data.columns)

['Trap',
 'Block',
 'Latitude',
 'Longitude',
 'Date',
 'Species',
 'WnvPresent',
 'AddressAccuracy',
 'NumMosquitos',
 'Tmax',
 'Tmin',
 'Tavg',
 'Depart',
 'DewPoint',
 'WetBulb',
 'Heat',
 'Cool',
 'Sunrise',
 'Sunset',
 'Depth',
 'SnowFall',
 'PrecipTotal',
 'StnPressure',
 'SeaLevel',
 'ResultSpeed',
 'ResultDir',
 'AvgSpeed']

In [337]:
# rearrange columns so 'WnvPresent' is at the end
data = data[['Trap', 'Block', 'Latitude', 'Longitude', 'Date', 'Species', 'AddressAccuracy', 'NumMosquitos', 
             'Tmax', 'Tmin', 'Tavg', 'Depart', 'DewPoint', 'WetBulb', 'Heat', 'Cool', 'Sunrise', 'Sunset', 
             'Depth', 'SnowFall', 'PrecipTotal', 'StnPressure', 'SeaLevel', 'ResultSpeed', 'ResultDir', 
             'AvgSpeed', 'WnvPresent']]
data.head()

,Trap,Block,Latitude,Longitude,Date,Species,AddressAccuracy,NumMosquitos,Tmax,Tmin,...,Sunset,Depth,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed,WnvPresent
0,T001,40,41.953705,-87.733974,2007-06-26,CULEX PIPIENS/RESTUANS,8,1,91.5,71.5,...,1931.0,0.0,0.0,0.0805,29.420,30.100,6.70,21.5,7.60,0
1,T001,40,41.953705,-87.733974,2007-07-11,CULEX PIPIENS/RESTUANS,8,1,77.0,62.5,...,1928.0,0.0,0.0,0.0000,29.255,29.925,8.95,30.0,11.05,0
2,T001,40,41.953705,-87.733974,2007-07-18,CULEX PIPIENS,8,1,85.0,69.0,...,1924.0,0.0,0.0,1.2350,29.145,29.835,9.70,24.0,10.35,0
3,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS,8,1,91.5,69.0,...,1911.0,0.0,0.0,0.0000,29.315,29.990,2.80,11.0,3.90,0
4,T001,40,41.953705,-87.733974,2007-08-01,CULEX PIPIENS/RESTUANS,8,3,91.5,69.0,...,1911.0,0.0,0.0,0.0000,29.315,29.990,2.80,11.0,3.90,0

In [338]:
# save data to a new .csv file
datapath = '../data'
save_file(data, 'WestNileVirus.csv', datapath)

A file already exists with this name.

Do you want to overwrite? (Y/N)Y
Writing file.  "../data/WestNileVirus.csv"